// [상이름, 대회이름] 순으로 입력해주세요.

export const AWARD_2024 = [
  ['코삭챌린저상(2)', '2024 KOSAC 대한민국 대학생 광고대회'],
  ['장려상', '제4회 PA 크리에이티브 어워드'],
  ['장려상', '트래블 이노베이션 아이디어 공모전'],
];

export const AWARD_2023 = [
  ['대상', '제3회 PA 크리에이티브 어워드'],
  ['우수상', '제3회 PA 크리에이티브 어워드'],
  ['장려상(2)', '제3회 PA 크리에이티브 어워드 장려상'],
  ['동상', '제44회 제일기획 아이디어 페스티벌'],
  ['동상', '제2회 hy프레딧 대학생 마케팅 공모전'],
  ['장려상', '2023 삼성화재 마케팅 해커톤'],
  ['입선', '2023 삼성화재 마케팅 해커톤'],
  ['동상(2)', '이노션 S.O.S'],
  ['AI활용특별상', '제5회 경기도 광고홍보제 공모전'],
  ['최우수상', '정관장 대학생 마케팅 공모전'],
  ['우수상', '정관장 대학생 마케팅 공모전'],
  ['장려상', '정관장 대학생 마케팅 공모전'],
  ['장려상', '삼정펄프 대학생 마케팅 공모전'],
  ['장려상', '제21회 KPR 대학생 PR 아이디어 공모전'],
];

export const AWARD_2022 = [
  ['최우수상', '제2회 PA 크리에이티브 어워드'],
  ['장려상(2)', '제2회 PA 크리에이티브 어워드'],
  ['코삭챌린저상(4)', '2022 KOSAC 대한민국 대학생 광고대회'],
  ['대상', '제7회 파크랜드 대학생 마케팅 공모전'],
  ['장려상(3)', '제7회 파크랜드 대학생 마케팅 공모전'],
  ['입선', '제7회 파크랜드 대학생 마케팅 공모전'],
  ['입선', '제20회 KPR 대학생 PR 아이디어 공모전'],
];

export const AWARD_2021 = [
  ['장려상', '제1회 미국마케팅협회 AMA PCM 대학생 광고공모전'],
  ['입선', '2021 KOSAC 대한민국 대학생 광고대회'],
  ['파이널리스트(3)', '2021 KOSAC 대한민국 대학생 광고대회'],
  ['입상', '피자헛 브랜드 공모전'],
  ['대상', '제6회 파크랜드 대학생 마케팅 공모전'],
  ['대상', '제19회 KPR 대학생 PR 아이디어 공모전'],
  ['입선(3)', '제19회 KPR 대학생 PR 아이디어 공모전'],
];

export const AWARD_2020 = [
  ['입선', '제1회 씰리코리아 마케팅 공모전'],
  ['파이널리스트(3)', '제41회 제일기획 아이디어 페스티벌'],
  ['파이널리스트', '제33회 HS애드 영크리에이터스 컴피티션 크리에이터 부문'],
  ['파이널리스트', '제33회 HS애드 영크리에이터스 컴피티션 기획서 부문'],
  ['은상', '제37회 DCA 광고대상 기획서 부문'],
  ['우수상', '제2회 서울 국제공공광고제 인쇄물 부문'],
  ['우수상', '제1회 레스토닉 광고 공모전 인쇄부문'],
  ['장려상', '제1회 레스토닉 광고 공모전 인쇄부문'],
  ['은상', '2020 KOSAC 대한민국 대학생 광고대회'],
  ['파이널리스트(3)', '2020 KOSAC 대한민국 대학생 광고대회'],
  ['대상', '제2회 미스터멘션 대학생 마케팅 공모전'],
  ['장려상', '제2회 미스터멘션 대학생 마케팅 공모전'],
  ['우수상', '제18회 KPR 대학생 PR 아이디어 공모전'],
];

export const AWARD_2019 = [
  ['장려상', '2019 아모레퍼시픽 마케팅 공모전'],
  ['본선', '제32회 HS애드 영크리에이터스 컴피티션 기획서 부문'],
  ['우수상', 'SK Broad band 백화점 스마트화 전략 아이디어 페스티벌'],
  ['대상', '섬마을 인생학교 힐링 프로그램 아이디어 공모전'],
  ['우수상', '하나투어 모하지 제1회 대학생 마케팅 공모전'],
  ['아이디어상', '하나투어 모하지 제1회 대학생 마케팅 공모전'],
  ['입선(2)', '제16회 KPR 대학생 PR 아이디어 공모전'],
  ['동상', '제11회 대휴 아이디어 공모전'],
  ['장려상', '대우전자 브랜드 마케팅 대학생 공모전'],
  ['장려상', '제4회 YOUTH CSR CONEFERENCE 기업 CSR 전략 공모전'],
];

export const AWARD_2018 = [
  ['동상', '제39회 제일기획 아이디어 페스티벌 기획서 부문'],
  ['본선', '2018 아모레퍼시픽 Brand Challenge Strategy 부문'],
  ['금상', '제31회 HS애드 영크리에이터스 컴피티션 기획서 부문'],
  ['우수상', '제9회 KT&G 상상실현 콘테스트'],
  ['은상', '제1회 MVP 프로젝트 Value-up 경진대회'],
  ['장려상', '제1회 좋은데이 마케팅 공모전'],
  ['우수상', '푸르덴셜 착한 프로젝트 공모전'],
];

export const AWARD_2017 = [
  ['입선', '제7회 롯데 아이디어 공모전 롯데홈쇼핑'],
  ['은상', '제7회 롯데 아이디어 공모전 롯데홈쇼핑'],
  ['대상', '제2회 삼성전자 노트북 9 Always 대학생 아이디어 공모전'],
  ['우수상', '제2회 삼성전자 노트북 9 Always 대학생 아이디어 공모전'],
  ['금상', '2017 한국투자증권 대학생 광고 공모전'],
  ['동상', '제38회 제일기획 아이디어 페스티벌'],
  ['특별상', '제38회 제일기획 아이디어 페스티벌'],
  ['우수상', '제12회 대학（원）생 노인복지 프로그램 공모전'],
  ['입선', '제2회 제주항공 Refresh 마케팅·광고 공모전'],
  ['본선', '제23회 LG글로벌챌린저'],
  ['본선', '제13회 아모레퍼시픽 마케팅 공모전'],
  ['금상', '제34회 DCA 광고대상 기획서 부문'],
  ['최우수상', '제11회 뉴트리라이트 대학생 광고 공모전'],
  ['우수상', '제11회 뉴트리라이트 대학생 광고 공모전'],
  ['우수상', '제8회 KT&G 상상실현 콘테스트'],
  ['은상', '제1회 NH투자증권 대학생 광고 공모전'],
  ['입선(2)', '제1회 NH투자증권 대학생 광고 공모전'],
  ['입선', '제1회 공항철도 수요증대 및 서비스 개선'],
  ['입선(2)', '제15회 KPR 대학생 PR 아이디어 공모전'],
  ['장려상', '제9회 대휴 아이디어 공모전'],
];

export const AWARD_2016 = [
  ['입선(2)', '서리풀 페스티벌 아이디어 공모전'],
  ['장려상', '서리풀 페스티벌 아이디어 공모전'],
  ['대상', '한림제약 호르반 마케팅 공모전'],
  ['우수상', '한림제약 호르반 마케팅 공모전'],
  ['최우수상', '스와니코코 아이디어 메이커 공모전'],
  ['우수상', 'KOTRA 해외마케팅 아이디어 경진대회'],
  ['파이널리스트', '한국투자증권 대학생 광고 공모전 TFAA'],
  ['입선', '제14회 KPR 대학생 PR 아이디어 공모전'],
];

export const AWARD_2015 = [
  ['장려상', '제4회 부산광역시 대학생 마케팅 공모전'],
  ['입선', '우정문화 PR전략 공모전'],
  ['우수상', '벤처기업 지속성장을 위한 채용 공모전'],
  ['파이널리스트(2)', '제28회 HSAD 대학생 광고 공모전'],
  ['장관상', '지식경제부 경제 아이디어 공모전 지식경제부'],
  ['장관상', '행정안전부 정책 아이디어 공모전 행정안전부'],
  ['입선(2)', '제13회 KPR 대학생 PR 아이디어 공모전'],
  ['동상', '제일기획 광고대상 작품부문'],
  ['입선', '제일기획 광고대상 작품부문'],
  ['2위', '한양대학교 주최 경영사례 개발 경진대회'],
  ['1위', '건국대학교 주최 경영사례 학술대회'],
  ['최우수상(2)', '보건복지부 암 예방 홍보전략 공모전'],
  ['징랴싱', '보건복지부 암 예방 홍보전략 공모전'],
];

export const AWARD_2014 = [
  ['장려상', '제3회 부산광역시 대학생 마케팅 공모전'],
  ['우수상', '2014 위성정보 신사업 모델 개발 공모전'],
  ['최우수상', '2014년 청소년 생활체육 활성화 방안'],
  ['최우수상', '2014년 aT Games 마케팅 전략'],
  ['최우수상', '2014년 6.4 지방선거 정책공약 공모전'],
  ['우수상', '2014년 한국축구과학회 아이디어 논문 공모전'],
  ['우수상', '2014년 청년공감공약정책공모전 새누리당'],
  ['장려상', '2014년 도봉구 영상공모전 도봉구청'],
  ['장려상', '2014년 한국수력원자력 논문 공모전'],
  ['최우수상', '제10회 아모레퍼시픽 마케팅 공모전'],
  ['장려상', '대학생 수돗물 공공 캠페인 콘테스트'],
  ['대상', '제40회 제일기획 아이디어 페스티벌 옥외광고 부문'],
  ['2위', 'Shh Creative Challenge'],
  ['파이널리스트(2)', '제27회 HS애드 대학생 광고대상'],
  ['동상', '제27회 HS애드 대학생 광고대상'],
  ['파이널리스트(2)', '2014년 KT 산학협력공모전'],
  ['우수상', '2014년 KT 산학협력공모전'],
  ['장려상', '제4회 부산광역시 대학생 마케팅 공모전'],
  ['입선', '우정문화 PR전략 공모전'],
  ['우수상', '벤처기업 지속성장을 위한 채용 공모전'],
];

export const AWARD_2013 = [
  ['입선', '2013 아모레퍼시픽 혁신상품개발'],
  ['우수상', '국가장학금 PR 공모전'],
  ['장려상', '국가장학금 PR 공모전'],
  ['팀선정', '2013 서울 사회적경제 아이디어 대회 프로젝트'],
  ['우수상', '제2회 스펙업 아이디어 공모전'],
  ['대상', '2013 토니모리 경영대학 마케팅 공모전'],
  ['본선(3)', '제9회 아모레퍼시픽 마케팅 공모전'],
  ['우수상', '제3회 볼빅 대학생 마케팅 공모전'],
  ['Top10선정', '2013 전세계 학생 3D CAD 모델링 경연대회'],
  ['최우수상', '한경 잡앤스토리 수상한 공모전학교'],
  ['장려상', '제11회 KPR 대학생 PR 아이디어 공모전'],
  ['입선(2)', '제11회 KPR 대학생 PR 아이디어 공모전'],
];

export const AWARD_2012 = [
  ['동상', '제12회 산타페 광고 공모전'],
  ['동상', '제3회 롯데 아이디어 공모전'],
  ['은상', '제33회 제일기획 대학생 광고대상 기획부문'],
  ['은상', '제25회 HSAD 대학생 광고대상'],
  ['동상', 'Korea Student Advertising Competition 지역예선'],
  ['본선(2)', '2012 아모레퍼시픽 마케팅 공모전'],
  ['우수상', '2012 MANDO 미래 Vehicle 아이디어 공모전'],
];

export const AWARD_2011 = [
  ['대상', '제32회 제일기획 대학생 광고대상 기획부문'],
  ['대상', '다음 미디컴 대학생 PR공모전'],
  ['동상', '코바코 Young Lions Challenge'],
  ['장려상', '삼성전자 대학생 마케팅 공모전'],
  ['은상', '제2회 롯데 아이디어 공모전'],
  ['동상', '제2회 롯데 아이디어 공모전'],
  ['장려상', '2011 한국 야쿠르트 대학생 PR 공모전'],
  ['우수상', '노리단 대학생 커뮤니케이션 경진대회'],
  ['장려상', '제9회 KPR 대학생 PR 아이디어 공모전'],
];

export const AWARD_2010 = [
  ['입선(2)', '제8회 KPR 대학생 PR 아이디어 공모전'],
  ['파이널리스트(2)', '제23회 HSAD 대학생 광고대상'],
  ['대상', '다음 미디컴 대학생 PR공모전'],
  ['우수상', '신세계 글로벌 유통 프론티어'],
  ['우수상', '아모제 외식산업 공모전'],
  ['입선', '2010 아모레퍼시픽 마케팅 공모전'],
  ['입선(2)', '코바코 Young Lions Challenge'],
  ['입선', '반크 대한민국 해외홍보대상'],
  ['입선', 'JC 엔터테인먼트 당신의 무한도전 UCC 공모전'],
];

export const AWARD_2009 = [
  ['본선', '코오롱 패션 어워드 브랜드 마케팅 부문'],
  ['입선', '결핵 예방 및 퇴치 홍보를 위한 광고 및 아이디어 공모전'],
  ['동상', '스포츠산업 진흥 아이디어 공모전'],
  ['동상', '2009 KOSAC 대한민국 대학생 광고대회 지역예선'],
  ['파이널리스트(2)', '2009 KOSAC 대한민국 대학생 광고대회'],
];

export const AWARD_2008 = [
  ['장려상', '대학생 수돗물 공공 캠페인 콘테스트'],
  ['입선', '한국 일러스트협회'],
  ['3위', 'SK 커뮤니케이션즈 스피쿠스 UCC 공모전'],
  ['동상', 'IDEA Challenge 풀무원'],
  ['장려상', '대학생 경제 유니버사이드 마케팅 부문'],
  ['입선', '우정문화 PR전략 공모전'],
  ['우수상', '벤처기업 지속성장을 위한 채용 공모전'],
];

export const AWARD_2007 = [
  ['대상', '공항공사광고 공모전 기획_포스터부문 통합'],
  ['대상', '롯데 환경 공모전'],
  ['우수상', '롯데 환경 공모전'],
  ['장려상(2)', '롯데 환경 공모전'],
  ['입선', '롯데 환경 공모전'],
  ['장려상', 'KT&G 마케팅 공모전'],
  ['파이널리스트', '2007 KOSAC 대한민국 대학생 광고대회'],
  ['은상', 'SOSFO 스포츠 마케팅 공모전 아이디어 공모전'],
  ['장려상', '대학생 PR전략 콘테스트'],
  ['은상', '인천공항 F&B 시설 마케팅 아이디어'],
  ['입선', '환경 공모전 마케팅 기획서 부문'],
  ['4위', '전국 대학생 선물시장 모의투자 대회'],
  ['입선', '현대 하이스코 과제 공모전 홍보부문'],
  ['최우수상', '동탄 신도시 네이밍 공모전'],
];

export const AWARD_2006 = [
  ['대상', 'KT&G 마케팅 공모전'],
  ['입선(2)', 'KT&G 마케팅 공모전'],
  ['대상', '대학생 연합 창업대전'],
  ['장려상', '공항공사 광고 기획서 부문'],
  ['동상', 'SKT 스포츠 마케팅 공모전'],
  ['파이널리스트', '2006 KOSAC 대한민국 대학생 광고대회'],
  ['장려상', '한국 PR협회 PR 공모전'],
  ['입선', '블루오션 파이오니어 공모전'],
  ['3위', '재정경제부 창업 아이디어 공모전'],
  ['우수상', '삼성 YPM 아이디어 공모전'],
  ['우수상', '2010 바이오 계획 네이밍 공모전'],
];

interface AwardSetType {
  [key: string]: string[][];
}

export const AWARD_SET: AwardSetType = {
  '2023': AWARD_2023,
  '2022': AWARD_2022,
  '2021': AWARD_2021,
  '2020': AWARD_2020,
  '2019': AWARD_2019,
  '2018': AWARD_2018,
  '2017': AWARD_2017,
  '2016': AWARD_2016,
  '2015': AWARD_2015,
  '2014': AWARD_2014,
  '2013': AWARD_2013,
  '2012': AWARD_2012,
  '2011': AWARD_2011,
  '2010': AWARD_2010,
  '2009': AWARD_2009,
  '2008': AWARD_2008,
  '2007': AWARD_2007,
  '2006': AWARD_2006,
};
